def morse_code(strng):

    MORZE = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..',
         '0': '-----', '1': '.----', '2': '..---',
         '3': '...--', '4': '....-', '5': '.....',
         '6': '-....', '7': '--...', '8': '---..',
         '9': '----.', ' ': '\n'}

    strng = strng.upper()
    for word in strng:
        for letter in word:
            print(MORZE[letter], end=' ')


# assert morse_code("Hello world") == '.... . .-.. .-.. ---\n.-- --- .-. .-.. -..'
# assert morse_code("Help me SOS") == '.... . .-.. .--.\n-- .\n... --- ...'
# print("Успешно! ЗАКОММЕНТИРУЙ СТРОКУ!!")


def main():

    strng = input()

    morse_code(strng)


if __name__ == '__main__':
    main()
